<a href="https://colab.research.google.com/github/RAYANE8LOUNIS/Deliveroo/blob/main/Introduction_to_SQL_sub_queries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Introduction to SQL Sub-Queries

This notebook explore the basics of the use of sub-queries with SQL

In [5]:
import sqlite3

# Create a database in memory
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create Tables
cursor.execute("""
CREATE TABLE Client (
    ClientId TEXT PRIMARY KEY,
    Name TEXT,
    Address TEXT,
    DateOfBirth DATE
);
""")

cursor.execute("""
CREATE TABLE Equipment (
    EquipCode TEXT PRIMARY KEY,
    EquipDescription TEXT,
    Price REAL
);
""")

cursor.execute("""
CREATE TABLE Orders (
    OrderNo TEXT PRIMARY KEY,
    OrderDate DATE,
    ClientId TEXT,
    FOREIGN KEY (ClientId) REFERENCES Client(ClientId)
);
""")

cursor.execute("""
CREATE TABLE Equipment_Purchased (
    EquipCode TEXT,
    OrderNo TEXT,
    Quantity INTEGER,
    PRIMARY KEY (EquipCode, OrderNo),
    FOREIGN KEY (EquipCode) REFERENCES Equipment(EquipCode),
    FOREIGN KEY (OrderNo) REFERENCES Orders(OrderNo)
);
""")

conn.commit()
print("Tables created successfully!")

Database 'School_DB' created successfully!
Tables created successfully!

In [4]:
# here is where to INSERTING VALUES

cursor.executemany("""
INSERT INTO Client (ClientId, Name, Address, DateOfBirth)
VALUES (?, ?, ?, ?);
""", [
    ('C022', 'James Murray', 'High St, Cambridge', '1998-08-12'),
    ('C012', 'Cornelius Garfield', 'Strand, Coventry', '1980-07-01'),
    ('C010', 'Mark Ekshaw', 'High Bank, Mansfield', '2002-01-18'),
    ('C001', 'James Worth', 'Old Road, Nottingham', '2005-05-20')
])

cursor.executemany("""
INSERT INTO Equipment (EquipCode, EquipDescription, Price)
VALUES (?, ?, ?);
""", [
    ('E001', 'Nao Robot', 4000),
    ('E006', 'PC', 300.00),
    ('E005', 'Pens', 1.50),
    ('E009', 'Baxter Robot', 53000.75)
])

cursor.executemany("""
INSERT INTO Orders (OrderNo, OrderDate, ClientId)
VALUES (?, ?, ?);
""", [
    ('O01', '2017-03-02', 'C022'),
    ('O02', '2017-03-10', 'C001')
])

cursor.executemany("""
INSERT INTO Equipment_Purchased (EquipCode, OrderNo, Quantity)
VALUES (?, ?, ?);
""", [
    ('E001', 'O01', 20),
    ('E006', 'O01', 10),
    ('E006', 'O02', 5),
    ('E009', 'O02', 5)
])

conn.commit()
print("Data inserted successfully!")

Data inserted successfully!

In [5]:
# here is a list clients who were 18 before Jan 1, 2017
cursor.execute("""
SELECT Name, Address, DateOfBirth
FROM Client
WHERE DateOfBirth <= date('2017-01-01', '-18 years');
""")

for row in cursor.fetchall():
    print(row)

('James Murray', 'High St, Cambridge', '1998-08-12')
('Cornelius Garfield', 'Strand, Coventry', '1980-07-01')

In [6]:
#Increase price of equipment E09 by 20%
cursor.execute("""
UPDATE Equipment
SET Price = Price * 1.2
WHERE EquipCode = 'E009';
""")
conn.commit()
print("Price updated successfully!")

Price updated successfully!

In [7]:
# here is the List of clients with orders, sorted by name and order date:
cursor.execute("""
SELECT c.Name AS 'Name of the Client',
       c.Address AS 'Address of the Client',
       c.DateOfBirth AS 'Date of Birth',
       o.OrderNo AS 'Order No',
       o.OrderDate AS 'Date Order Made'
FROM Client c
JOIN Orders o ON c.ClientId = o.ClientId
ORDER BY c.Name ASC, o.OrderDate ASC;
""")

for row in cursor.fetchall():
    print(row)

('James Murray', 'High St, Cambridge', '1998-08-12', 'O01', '2017-03-02')
('James Worth', 'Old Road, Nottingham', '2005-05-20', 'O02', '2017-03-10')

That's it, this code should be used as a complement to the article

task 2

In [43]:
import sqlite3

# Create the database file
conn = sqlite3.connect("School_DB.db")
cursor = conn.cursor()
print("Database 'School_DB' created successfully!")

Database 'School_DB' created successfully!

In [44]:
cursor.execute("DROP TABLE IF EXISTS Module;")
cursor.execute("DROP TABLE IF EXISTS Student;")
cursor.execute("DROP TABLE IF EXISTS Grading;")
conn.commit()
print(" Old tables dropped successfully!")

 Old tables dropped successfully!

In [45]:
# Create Module Table
cursor.execute("""
CREATE TABLE Module (
    ModuleCode TEXT PRIMARY KEY,
    ModuleName TEXT NOT NULL,
    Teacher TEXT NOT NULL,
    Credits INTEGER NOT NULL
);
""")

# Create Student Table
cursor.execute("""
CREATE TABLE Student (
    StudentID TEXT PRIMARY KEY,
    FirstName TEXT NOT NULL,
    LastName TEXT NOT NULL,
    Major TEXT NOT NULL CHECK (Major IN ('Business', 'Computer Science', 'Economics', 'Law')),
    DateOfBirth DATE NOT NULL,
    StudentDebt REAL DEFAULT 0
);
""")

# Create Grading Table
cursor.execute("""
CREATE TABLE Grading (
    StudentID TEXT,
    ModuleCode TEXT,
    Mark INTEGER,
    PRIMARY KEY (StudentID, ModuleCode),
    FOREIGN KEY (StudentID) REFERENCES Student(StudentID),
    FOREIGN KEY (ModuleCode) REFERENCES Module(ModuleCode)
);
""")

conn.commit()
print(" Tables 'Module', 'Student', 'Grading' created successfully miss fakiha!")

 Tables 'Module', 'Student', 'Grading' created successfully miss fakiha!

In [46]:
# Insert Modules
cursor.executemany("""
INSERT INTO Module (ModuleCode, ModuleName, Teacher, Credits)
VALUES (?, ?, ?, ?);
""", [
    ('CS101', 'Introduction to Programming', 'Dr. Smith', 3),
    ('CS102', 'Data Structures', 'Dr. Johnson', 4),
    ('EC201', 'Microeconomics', 'Dr. Brown', 3),
    ('LW301', 'Criminal Law', 'Dr. White', 4)
])

# Insert Students
cursor.executemany("""
INSERT INTO Student (StudentID, FirstName, LastName, Major, DateOfBirth, StudentDebt)
VALUES (?, ?, ?, ?, ?, ?);
""", [
    ('S001', 'Alice', 'Williams', 'Computer Science', '2000-05-15', 1000),
    ('S002', 'Bob', 'Johnson', 'Economics', '1999-08-22', 200),
    ('S003', 'Charlie', 'Brown', 'Business', '2001-02-10', 50),
    ('S004', 'David', 'Smith', 'Law', '2002-11-30', 0)
])

# Insert Grading Data
cursor.executemany("""
INSERT INTO Grading (StudentID, ModuleCode, Mark)
VALUES (?, ?, ?);
""", [
    ('S001', 'CS101', 85),
    ('S002', 'EC201', 78),
    ('S003', 'CS102', 90),
    ('S004', 'LW301', 88)
])

conn.commit()
print(" Data inserted successfully!")

 Data inserted successfully!

In [47]:
import os
os.rename("School_DB.db", "International_College.db")
print(" Database renamed successfully!")
conn = sqlite3.connect("International_College.db")
cursor = conn.cursor()
print(" Connected to 'International_College' database!")

 Database renamed successfully!
 Connected to 'International_College' database!

In [48]:
cursor.execute("ALTER TABLE Module RENAME TO Module_2022;")
cursor.execute("ALTER TABLE Student RENAME TO Student_2022;")
cursor.execute("ALTER TABLE Grading RENAME TO Grading_2022;")
conn.commit()
print(" Tables renamed successfully miss Fakiha!")

 Tables renamed successfully miss Fakiha!

In [49]:
# Helper function to run and display queries
def run_query(query, description=""):
    print("\n" + description)
    cursor.execute(query)
    for row in cursor.fetchall():
        print(row)

# 1. List Modules Alphabetically
run_query("SELECT ModuleName FROM Module_2022 ORDER BY ModuleName ASC;", " Modules Sorted Alphabetically:")

# 2. List Students by Date of Birth
run_query("SELECT StudentID, FirstName, LastName, Major, DateOfBirth FROM Student_2022 ORDER BY DateOfBirth ASC;", " Students Sorted by DOB:")

# 3. List Teachers and Their Modules
run_query("SELECT Teacher, ModuleName FROM Module_2022 ORDER BY Teacher ASC;", " Teachers and Their Modules:")

# 4. Calculate Average Student Debt
run_query("SELECT AVG(StudentDebt) FROM Student_2022;", " Average Student Debt:")

# 5. Create Temporary Table 'List' (SQLite uses temporary tables differently)
cursor.execute("""
CREATE TEMP TABLE List AS
SELECT g.StudentID, s.FirstName, g.ModuleCode, m.ModuleName
FROM Grading_2022 g
JOIN Student_2022 s ON g.StudentID = s.StudentID
JOIN Module_2022 m ON g.ModuleCode = m.ModuleCode;
""")
run_query("SELECT * FROM List;", " Temporary Table 'List' Data:")

# 6. Count Students per Major
run_query("SELECT Major, COUNT(*) FROM Student_2022 GROUP BY Major;", " Number of Students Per Major:")

# 7. Delete Law Students and Undo
run_query("SELECT * FROM Student_2022 WHERE Major = 'Law';", " Law Students Before Deletion:")
cursor.execute("DELETE FROM Student_2022 WHERE Major = 'Law';")
run_query("SELECT * FROM Student_2022;", " Students After Deleting Law Major:")
conn.rollback()  # Undo delete
run_query("SELECT * FROM Student_2022;", "Law Students Restored (Rollback Successful):")

# 8. List Students Who Got a Grade 'A'
run_query("""
SELECT s.StudentID, s.FirstName, s.LastName, s.Major, g.ModuleCode, m.ModuleName
FROM Grading_2022 g
JOIN Student_2022 s ON g.StudentID = s.StudentID
JOIN Module_2022 m ON g.ModuleCode = m.ModuleCode
WHERE g.Mark >= 85;
""", " Students Who Got an A:")

# 9. Find Student with Least Debt
run_query("SELECT StudentID, FirstName, LastName, Major, StudentDebt FROM Student_2022 ORDER BY StudentDebt ASC LIMIT 1;", " Student with Least Debt:")

 Modules Sorted Alphabetically:
('Criminal Law',)
('Data Structures',)
('Introduction to Programming',)
('Microeconomics',)

 Students Sorted by DOB:
('S002', 'Bob', 'Johnson', 'Economics', '1999-08-22')
('S001', 'Alice', 'Williams', 'Computer Science', '2000-05-15')
('S003', 'Charlie', 'Brown', 'Business', '2001-02-10')
('S004', 'David', 'Smith', 'Law', '2002-11-30')

 Teachers and Their Modules:
('Dr. Brown', 'Microeconomics')
('Dr. Johnson', 'Data Structures')
('Dr. Smith', 'Introduction to Programming')
('Dr. White', 'Criminal Law')

 Average Student Debt:
(312.5,)

 Temporary Table 'List' Data:
('S001', 'Alice', 'CS101', 'Introduction to Programming')
('S002', 'Bob', 'EC201', 'Microeconomics')
('S003', 'Charlie', 'CS102', 'Data Structures')
('S004', 'David', 'LW301', 'Criminal Law')

 Number of Students Per Major:
('Business', 1)
('Computer Science', 1)
('Economics', 1)
('Law', 1)

 Law Students Before Deletion:
('S004', 'David', 'Smith', 'Law', '2002-11-30', 0.0)

 Students After Deleting Law Major:
('S001', 'Alice', 'Williams', 'Computer Science', '2000-05-15', 1000.0)
('S002', 'Bob', 'Johnson', 'Economics', '1999-08-22', 200.0)
('S003', 'Charlie', 'Brown', 'Business', '2001-02-10', 50.0)

Law Students Restored (Rollback Successful):
('S001', 'Alice', 'Williams', 'Computer Science', '2000-05-15', 1000.0)
('S002', 'Bob', 'Johnson', 'Economics', '1999-08-22', 200.0)
('S003', 'Charlie', 'Brown', 'Business', '2001-02-10', 50.0)
('S004', 'David', 'Smith', 'Law', '2002-11-30', 0.0)

 Students Who Got an A:
('S001', 'Alice', 'Williams', 'Computer Science', 'CS101', 'Introduction to Programming')
('S003', 'Charlie', 'Brown', 'Business', 'CS102', 'Data Structures')
('S004', 'David', 'Smith', 'Law', 'LW301', 'Criminal Law')

 Student with Least Debt:
('S004', 'David', 'Smith', 'Law', 0.0)